Repository: AbdulrahmanMAZ/WonD_My_Graduation_Project
Catalog: lib/l10n/app_*.arb
Languages: ar

# language
source: English
ar: العربية

source: Home Page
ar: الصفحة الرئيسية

source: Welcome
ar: اهلا و سهلا

source: Register
ar: التسجيل

# gotoregisterNOAccount
source: Do not have an account ?
ar: لا تملك حساب بالفعل ؟

# grettingParagrath
source: Nice to see you again,if you have an account you can login from here
ar: مرحبا بك , اذا كانت هذه هي زيارتك الاولى للبرنامج يمكنك التسجيل عن طريق زر التسجيل بالأسفل

# enterEmail
source: Enter an E-Mail
ar: ادخل بريدك الالكتروني

# enterPass
source: Enter Your Password
ar: ادخل كلمة المرور

# enterName
source: Enter Your Name
ar: ادخل اسمك الكامل

# shorPass
source: Your password must be longer than 8 letters
ar: يجب على الرقم السري ان يتجاوز 8 خانات

# incorrectInfo
source: Incorrect information
ar: البيانات المدخلة غير صحيحة

# loginButton
source: Login
ar: تسجيل الدخول

# haveAccount
source: Already have an account ?
ar: هل تمتلك حساب بالفعل؟

# registerWelcomeParagraph
source: Nice to see you in our app,here is the register page and you can create new account from here
ar: مرحبا بك زائرنا الكريم من هنا تستطيع انشاء حساب جديد

source: Full Name
ar: الاسم الكامل

source: E-Mail
ar: البريد الالكتروني غير صاالح

source: Phone Number
ar: رقم الجوال

# enterPhoneNumber
source: Enter Your phone
ar: ادخل رقم الجوال

# notValidPhoneNumber
source: Not a valid phone number
ar: رقم الجوال غير صالح

# phoneNumberExample
source: Phone Number Ex: 53XXXXXXX
ar: مثال على رقم الجوال: 53XXXXXXX

# reEnterPass
source: Enter Your Password Again
ar: ادخل كلمة المرور مرة أخرى للتأكيد

# notMatchPass
source: Must match your password
ar: كلمات المرور المدخلة غير متطابقة

# empty
source: Must Enter a Value
ar: يجب ملئ هذا الحقل

# asWorker
source: What is your profession?
ar: ماهي مهنتك ؟

source: Hair Dresser
ar: ميكب ارتست / حلاق

source: Electrician
ar: كهربائي

source: Mechanic
ar: ميكانيكي

source: Plumber
ar: سباكة
